---
kind: property
id: P:Autodesk.Revit.DB.Macros.MacroModule.MacroLevel
source: html/94983497-52ec-c444-a712-c81dec19db74.htm
---
# Autodesk.Revit.DB.Macros.MacroModule.MacroLevel Property

The Macro level.

## Syntax (C#)
```csharp
public MacroLevel MacroLevel { get; }
```